app/Controllers/JemaatController.php

SELECT *
FROM `tbl_jemaat`
WHERE `tbl_jemaat`.`deleted_at` IS NULL
AND `tbl_jemaat`.`id` = '206'
---
    public function search()
    {
        $id = $this->request->getGet('id');
        $jemaat = null;

        // Jika ada ID dari klik Autocomplete, tarik datanya dari database
        if ($id) {
            $jemaat = $this->jemaatModel->find($id);