app/Models/JemaatModel.php

    public function getJemaatSSP(string $search = '', string $sortCol = 'nama_lengkap', string $sortDir = 'ASC', int $limit = 10, int $offset = 0)
    {
        if (!empty($search)) {
            $this->groupStart()
                ->like('nama_lengkap', $search, 'both', null, true)
                ->orLike('nij', $search, 'both', null, true)
                ->groupEnd();
        }

        return $this->orderBy($sortCol, $sortDir)->findAll($limit, $offset);
---
SELECT *
FROM `tbl_jemaat`
WHERE `tbl_jemaat`.`deleted_at` IS NULL
ORDER BY `nama_lengkap` ASC
 LIMIT 10

    public function countJemaatSSP(string $search = '')
    {
        if (!empty($search)) {
            $this->groupStart()
                ->like('nama_lengkap', $search, 'both', null, true)
                ->orLike('nij', $search, 'both', null, true)
                ->groupEnd();
        }

        return $this->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_jemaat`
WHERE `tbl_jemaat`.`deleted_at` IS NULL

    public function searchAutocomplete(string $keyword, int $limit = 5): array
    {
        return $this->select('tbl_jemaat.id, tbl_jemaat.nij, tbl_jemaat.nama_lengkap, tbl_jemaat.status_jemaat, tbl_jemaat.hp1, tbl_jemaat.pekerjaan, tbl_jemaat.tempat_lahir, tbl_jemaat.tanggal_lahir, tbl_jemaat.jenis_kelamin, tbl_jemaat_pasangan.tempat_nikah, tbl_jemaat_pasangan.tanggal_nikah')
            ->join('tbl_jemaat_pasangan', 'tbl_jemaat_pasangan.id_jemaat = tbl_jemaat.id', 'left') // Join tabel pasangan
            ->groupStart()
            ->like('tbl_jemaat.nama_lengkap', $keyword, 'both', null, true)
            ->orLike('tbl_jemaat.nij', $keyword, 'both', null, true)
            ->groupEnd()
            ->orderBy('tbl_jemaat.nama_lengkap', 'ASC')
            ->limit($limit)
            ->get()
            ->getResultArray();
---
SELECT `tbl_jemaat`.`id`, `tbl_jemaat`.`nij`, `tbl_jemaat`.`nama_lengkap`, `tbl_jemaat`.`status_jemaat`, `tbl_jemaat`.`hp1`, `tbl_jemaat`.`pekerjaan`, `tbl_jemaat`.`tempat_lahir`, `tbl_jemaat`.`tanggal_lahir`, `tbl_jemaat`.`jenis_kelamin`, `tbl_jemaat_pasangan`.`tempat_nikah`, `tbl_jemaat_pasangan`.`tanggal_nikah`
FROM `tbl_jemaat`
LEFT JOIN `tbl_jemaat_pasangan` ON `tbl_jemaat_pasangan`.`id_jemaat` = `tbl_jemaat`.`id`
WHERE   (
LOWER(`tbl_jemaat`.`nama_lengkap`) LIKE '%iwan%' ESCAPE '!'
OR  LOWER(`tbl_jemaat`.`nij`) LIKE '%iwan%' ESCAPE '!'
 )
ORDER BY `tbl_jemaat`.`nama_lengkap` ASC
 LIMIT 5