app/Models/PelayananModel.php

  public function getActivePelayanan(): array
  {
    return $this->select('id, nama_pelayanan')
      ->orderBy('nama_pelayanan', 'ASC')
      ->asArray() // <--- Paksa menjadi array khusus untuk query ini
      ->findAll();
---
SELECT `id`, `nama_pelayanan`
FROM `tbl_pelayanan`
WHERE `tbl_pelayanan`.`deleted_at` IS NULL
ORDER BY `nama_pelayanan` ASC